app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "content1"], ["picture", "zuH5gRQ_-_Imgur.jpg"], ["user_id", 1], ["created_at", "2015-11-21 14:29:09.050718"], ["updated_at", "2015-11-21 14:29:09.050718"]]
---
	def create
		@micropost = current_user.microposts.build(microposts_params)
		if @micropost.save